from numpy import sqrt


reloadValue = {
    "キアサージ":151,#まだ完凸
    "アルザス":177+1,
    "ニュージャージ":(177+1)*1.1,#結婚済み、まだ200好感度
    "フッテン＿旗艦":(180+1)*1.15,
    "フッテン＿僚艦":(180+1)*1.15*1.5,
    "ビスアルクZwei":(170+1)*1.15,
    #"グローセ":159+1,
    "ソユーズ1":166,#まだ完凸
    "ソユーズ2":166*1.1
}

skill = {
    "キアサージ":0,
    "アルザス":0,
    "ニュージャージ":1.1,
    "フッテン＿旗艦":1.15,
    "フッテン＿僚艦":1.15*1.5,
    "ビスアルクZwei":1.15,
    #"グローセ":0,
    "ソユーズ1":0,
    "ソユーズ2":1.1
}

attackTime = {
    "試作型406mm/50三連装砲T0":24.02,#シャンパーニュ砲
    "試製410mm三連装砲T0":24.14,#出雲砲
    "試製381mm三連装砲T0":23.14,#モナーク砲
    "試作型406mmSKC連装砲T0":19.42,#グローセ砲
    "試作型305mmSKC39三連装砲T0":18.20,#オーディン砲
    "試作型457mm連装砲MKAT0":20.65,#ジョージア砲
    "460mm三連装砲T0":30.59,#武蔵砲
    "406mm三連装砲MK7T0":24.22#ニュージャージ砲
}

equipment = {
    "0":0,
    "自動装填機構T3":38
}

love = {
    "愛":1.06,
    "結婚1":1.09,
    "結婚2":1.10,
    "結婚3":1.11,
    "結婚4":1.12,
}

a = str(input("艦船："))
b = str(input("装備："))
c = str(input("設備："))
d = str(input("好感度："))

time = attackTime[b] * sqrt(200 / (100 + (reloadValue[a] + equipment[c]) * love[d] * skill[a]))